tap "hashicorp/tap" unless ENV["SKIP_VAULT"] == "1"

brew "cmake"
brew "fnm"
brew "gh"
brew "jq"
brew "openssl@3"
brew "uv"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "minikube" unless ENV["SKIP_MINIKUBE"] == "1"
brew "hashicorp/tap/vault" unless ENV["SKIP_VAULT"] == "1"

cask "orbstack" unless ENV["SKIP_ORBSTACK"] == "1"
cask "wezterm" unless ENV["SKIP_WEZTERM"] == "1"
cask "zed" unless ENV["SKIP_ZED"] == "1"
cask "android-platform-tools" unless ENV["SKIP_ANDROID_PLATFORM_TOOLS"] == "1"
cask "blackhole-2ch" unless ENV["SKIP_BLACKHOLE"] == "1"
cask "blackhole-64ch" unless ENV["SKIP_BLACKHOLE"] == "1"
cask "font-meslo-lg-nerd-font" unless ENV["SKIP_FONT_MESLO"] == "1"
cask "localsend" unless ENV["SKIP_LOCALSEND"] == "1"
