tap "hashicorp/tap"

brew "cmake"
brew "fnm"
brew "gh"
brew "jq"
brew "minikube"
brew "openssl@3"
brew "uv"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/vault"

cask "android-platform-tools"
cask "blackhole-2ch"
cask "blackhole-64ch"
cask "font-meslo-lg-nerd-font"
cask "localsend"
cask "orbstack"
cask "wezterm"
cask "zed"
